## Merge

__Syntax__:

DataFrame.merge(right, how ='inner', on=None, left_on = None, right_on = None, left_index = False, right_index = False, sort = False, suffixes = ('_x','_y'), copy = None, indicator = False, validate = None)

In [2]:
import pandas as pd 

df1 = pd.DataFrame({'lkey': ['foo', 'bar', 'baz', 'foo'],
                    'value': [1, 2, 3, 5]})
df2 = pd.DataFrame({'rkey': ['foo', 'bar', 'baz', 'foo'],
                    'value': [5, 6, 7, 8]})

df1

  lkey  value
0  foo      1
1  bar      2
2  baz      3
3  foo      5

In [2]:
df1.merge(df2, left_on='lkey', right_on='rkey')

  lkey  value_x rkey  value_y
0  foo        1  foo        5
1  foo        1  foo        8
2  bar        2  bar        6
3  baz        3  baz        7
4  foo        5  foo        5
5  foo        5  foo        8

In [3]:
df1.merge(df2, left_on='lkey', right_on='rkey',
          suffixes=('_left', '_right'))

  lkey  value_left rkey  value_right
0  foo           1  foo            5
1  foo           1  foo            8
2  bar           2  bar            6
3  baz           3  baz            7
4  foo           5  foo            5
5  foo           5  foo            8

In [4]:
df1 = pd.DataFrame({'a': ['foo', 'bar'], 'b': [1, 2]})
df2 = pd.DataFrame({'a': ['foo', 'baz'], 'c': [3, 4]})
df1

     a  b
0  foo  1
1  bar  2

In [5]:
df1.merge(df2, how='inner', on='a')

     a  b  c
0  foo  1  3

In [6]:
df1.merge(df2, how='left', on='a')

     a  b    c
0  foo  1  3.0
1  bar  2  NaN

In [7]:
df1 = pd.DataFrame({'left': ['foo', 'bar']})
df2 = pd.DataFrame({'right': [7, 8]})
df1

  left
0  foo
1  bar

In [8]:
df1.merge(df2, how='cross')

  left  right
0  foo      7
1  foo      8
2  bar      7
3  bar      8

## Concatination

__Syntax__:

__pandas.concat(objs,*,axis = 0, join = 'outer', ignore_index = False, keys = None, levels = None, names= None, verify_integrity = False, sort = False, copy = None)__

Concatenate pandas object along a particular axis. 

Allows optional set logic along the other axes. 

Can also add a layer of hierarchical indexing on the concatenation axis, which may be useful if the lables are the same (or overlapping) on the passed axis number.

In [3]:
s1 = pd.Series(['a','b'])
s2 = pd.Series(['c','d'])
pd.concat([s1,s2])

0    a
1    b
0    c
1    d
dtype: object

In [4]:
#Clear The existing index and reset it in the result by setting the 'ignore_index' option 'True'

pd.concat([s1,s2],keys = ['s1','s2'])

s1  0    a
    1    b
s2  0    c
    1    d
dtype: object

In [5]:
#Label the index keys you create with the 'names' option 

pd.concat([s1,s2],keys= ['s1','s2'],names = ['Series name','Row ID'])

Series name  Row ID
s1           0         a
             1         b
s2           0         c
             1         d
dtype: object

In [6]:
#Combine two DataFrame objects with identical columns.

df1 = pd.DataFrame([['a',1],['b',2]], columns = ['letter','number'])

df1

  letter  number
0      a       1
1      b       2

In [7]:
df2 = pd.DataFrame([['c',3],['d',4]],columns = ['letter','number'])

df2

  letter  number
0      c       3
1      d       4

In [8]:
pd.concat([df1,df2])

  letter  number
0      a       1
1      b       2
0      c       3
1      d       4